{
  "collection": {
    "title": "Juleah Miller's Comic Projects",
    "description": "Comics, visual narratives, and collaborative works from The Azirona Drift",
    "author": "Juleah Miller"
  },
  "projects": [
    {
      "id": "liminal-webcomic",
      "title": "Liminal",
      "status": "published",
      "type": "webcomic",
      "shortDescription": "Ongoing webcomic exploring the spaces between worlds. Follow the story on Webtoon.",
      "detailedDescription": "Liminal follows Maya, a digital artist who discovers that the spaces between online and offline worlds are inhabited by mysterious entities. As she navigates both digital landscapes and physical reality, she must learn to bridge these liminal spaces to protect both worlds. The comic explores themes of technology, identity, and the blurred boundaries of modern existence.",
      "genre": "Science Fiction/Fantasy",
      "publishDate": "2024-09-01",
      "episodeCount": 12,
      "platform": "Webtoon",
      "coverImage": "images/liminal-cover.jpg",
      "readLinks": [
        {
          "platform": "Webtoon",
          "url": "https://www.webtoons.com/example",
          "description": "Read all episodes"
        }
      ],
      "excerpt": "The screen flickered, and for just a moment, Maya saw something moving in the space between pixels—something that shouldn't exist in the digital realm.",
      "themes": ["technology", "identity", "digital worlds", "liminal spaces", "connection"],
      "artStyle": "Digital illustration with vibrant colors and surreal elements",
      "updateSchedule": "Completed series",
      "awards": ["Webtoon Canvas Rising Star 2024"],
      "collaborativeNote": "Story concept developed in collaboration with Alek Miller"
    },
    {
      "id": "new-comic-project",
      "title": "Untitled Comic Project",
      "status": "work-in-progress",
      "type": "comic series",
      "shortDescription": "New comic series in early development exploring themes of connection and technology.",
      "detailedDescription": "An upcoming comic series that explores how people maintain authentic connections in an increasingly digital world. Following multiple characters across different generations, the story weaves together narratives about family, technology, and the evolving nature of human relationships in the digital age.",
      "genre": "Slice of Life/Science Fiction",
      "estimatedCompletion": "TBD",
      "progress": "Story outline and character concepts",
      "coverImage": "images/new-comic-concept.jpg",
      "excerpt": "Character concepts and story outlines are in development, focusing on authentic human connections in digital spaces.",
      "themes": ["family", "technology", "connection", "generational differences", "authenticity"],
      "artStyle": "To be determined - experimenting with mixed traditional and digital techniques",
      "plannedLength": "Ongoing series",
      "inspiration": "Based on observations of how different generations interact with technology"
    },
    {
      "id": "collaborative-graphic-novel",
      "title": "Collaborative Graphic Novel",
      "status": "planning",
      "type": "graphic novel",
      "shortDescription": "Full collaboration combining Alek's storytelling with Juleah's visual narrative expertise.",
      "detailedDescription": "A science fiction graphic novel that represents the full creative collaboration between Alek and Juleah Miller. Combining Alek's narrative expertise with Juleah's visual storytelling, this project explores themes of preservation, memory, and the intersection of technology with human experience in a near-future desert setting.",
      "genre": "Science Fiction",
      "plannedStart": "Summer 2025",
      "estimatedLength": "120 pages",
      "coverImage": "images/collaborative-gn-concept.jpg",
      "concept": "Near-future story about digital preservation specialists working to save human knowledge and culture in a world of failing technology",
      "themes": ["preservation", "memory", "collaboration", "technology", "desert landscapes"],
      "artStyle": "Full-color digital illustration with emphasis on environmental storytelling",
      "collaboration": "Joint creative development with Alek Miller - story and art developed together",
      "setting": "Near-future American Southwest"
    },
    {
      "id": "art-book-compilation",
      "title": "Art Book Compilation",
      "status": "planning",
      "type": "art book",
      "shortDescription": "Comprehensive collection of artwork spanning multiple projects and themes.",
      "detailedDescription": "A retrospective art book showcasing artwork from various projects including Liminal, character designs, concept art, and standalone illustrations. The book will include behind-the-scenes commentary on the creative process and artistic development across different projects.",
      "plannedStart": "2026",
      "estimatedLength": "80 pages",
      "coverImage": "images/artbook-concept.jpg",
      "includesProjects": ["Liminal", "Character designs", "Concept art", "Standalone illustrations"],
      "themes": ["artistic process", "character design", "visual development", "creative journey"],
      "format": "High-quality print publication with digital companion",
      "concept": "Chronicle of artistic growth and project development across multiple creative works"
    }
  ],
  "metadata": {
    "totalProjects": 4,
    "publishedWorks": 1,
    "worksInProgress": 1,
    "futureProjects": 2,
    "collaborativeProjects": 2,
    "lastUpdated": "2025-01-15"
  }
}