[
  {
    "id": 27,
    "date": "2026-02-02T02:58:39+00:00",
    "text": "Visual vs Literary\n\nEveryone has a \"first time\" with Lord of the Rings. Mine was via Peter Jackson's movie trilogy. Like everyone else, I watched and loved it. I picked up The Silmarillion because the title sounded cool and figured how different could it be? Age: 15. Big mistake. Please do not do that. I had a really bad time with it, could not get past Tolkien's writing style, nor could I for the life of me keep track of the many diferent characters. I read slowly as-is, but to my credit, I brute forced my way through it within... a year, I think.\n18 years later, I finally decide to listen to J.R.R. Tolkien's epic via audiobook. I set the speed to 2x (it is rare for me to set it below 1.3x). I would never have completed it if I were stuck at 1x, not due to time constraints but because I would have dropped it. Sorry, guys. Still nothin' doin'.\nOne distinct advantage to the audiobook narration over just reading it is the narrator actually sang the songs. That proved to be an unexpected boon.\nIs my problem the fact I saw a visual version before reading the literary source? Honestly, I really don't think so. Tolkien's writing style is still is a complete whiff for me. I'm not going to say he was a bad writer, all I'm saying is his pulp will never be something my brain can digest.\nTom Clancy, oddly, is pulp my brain CAN digest. I will never recommend a Clancy novel to anyone just out of the blue. His books are long, preachy, and long. You have to show an interest and ask me for a recommendation before I suggest \"Without Remorse\" to you.\n\"Hunt for Red October\" was a movie I watched well before I listened to the novel. I had already listened to the rest of the books in the series by the time I got to the narration of this first entry. Sean Connery, Alec Baldwin, Tim Curry, James Earl Jones, and the rest of the cast nailed it. There's an abridged narration of the audiobook I realy liked, too; basically follows the formula of the film. I expected the full, unabridged audiobook to be tight, compact, straightforward, enjoyable, and filled with amateurish charm.\nIt's actually my least favoirte book in the series. (\"The Bear and the Dragon\" slides in at second worst) The problem is it's NOT tight, compact, straightforward, or enjoyable. It's filled with amateurish over-attention to too many details, droning on and on about technical stuff in a way that is boring here that he somehow corrects by the time Clancy gets to the next Jack Ryan entry, \"Patriot Games.\"\nIn any event, for Clancy and \"Hunt for Red October,\" the abridged book and the film adaptation are on the same level. Visual and literary are equal here. The full book doesn't come close to either of those for the objective reasons I mentioned.\nNow for an example of a modern adaptation (albeit still literary) that vastly improves upon the source: William Hope Hodgson's \"The Night Land.\" Wife read this in the original \"Greek,\" so to speak and will never do that again. Hodgson's style is archaic, meandering, and overpunctuated (too many commas all over the place). James Stoddard retold the story and made it at least readable for modern audiences. I managed to get through it. I cannot even imagine attempting the source.\n\"3 Body Problem\" I unfortunately watched via Netflix before getting to Cixin Liu's novels. His fans swear by the books and take issue with Netflix disincluding a lot of the deeper scientific aspects. Look, my Bachelor's is of Science and I still struggled to keep up. I see why the version with Benedict Wong, Liam Cunningham, and co. is more digestable for a lot of people. (I can't say \"more\" people because China has a lot of those)",
    "author": "Alek Miller",
    "photo": null
  },
  {
    "id": 28,
    "date": "2026-02-02T02:58:39+00:00",
    "text": "I guess my point in saying all this is that the literary isn't inherently better than the visual. The vice versa sounds absurd, but it doesn't go without saying: the visual isn't inherently better than the literary. \"The books/manga are better\" can't simply be presumed, there must be objective reasons why they're better. \"The movies/TV series are better\" is far less common, but no less presumptuous, and the criteria must be similarly objective.\nSay you just like the written word more, and prefer the mental images in your head over the concocted ones on-screen. That's fine. Perfectly valid. No argument from me. But to say that it's objectively better cannot be simply taken for granted. Lemme spitfire some examples to get you thinking:\nIs \"The Lion, the Witch, and the Wardrobe\" better as a book or as the Disney film adaptation? What about the BBC version, hahahaha?\nIs \"The Expanse\" better as the 9-book series, or the 6-season show? (I really enjoyed both)\nIs \"Babette's Feast\" better as the feature-length foreign film, or the 45-page novella?\nIs \"Fullmetal Alchemist\" better as a manga, or either the first adaptation or the \"Brotherhood\" one?\nIs \"Star Wars\" better as a film saga, than it is in the dozens of novels?\nIs \"Harry Potter\" better on-screen, or in-page?\nLet's throw a different wrench into the mix: compare a written story to a comic adaptation. Which is better? What if the comic got turned into a novel? Would that be an improvement?\nI suppose there's a really useful (if very controversial) way to test thses comparisons. And I'll go back to LotR since that seems to be the big one. AI technology has and will continue to advance to the point that Tolkien's classic can be 1-to-1 adapted visually. You can keep Tom Bombadil. You can end with the scouring of the Shire. Would superfans like that more than Peter Jackson's more cinematically-contained version? Would superfans find it objectively better?",
    "author": "Alek Miller",
    "photo": null
  },
  {
    "id": 26,
    "date": "2026-01-25T21:54:57+00:00",
    "text": "This was the batch I did last month. I used tater tots at first, but have switched to tortilla chips. Best time to eat is about a minute after pouring the hot stuff onto the chips, so that they're crunchy, but not too crunchy.\n\nTex-Mex Shakshuka\n\nIngredients:\nButter\n1 medium yellow onion\n1 can (28oz) crushed tomatoes\nGarlic powder\nChili powder\nCumin\nRed bell pepper\nGreen bell pepper\nSalt (to taste)\n6 large eggs\nTortilla chips\nQueso fresco\nAvocado\n\nHeat a skillet or pan to medium heat, adding butter to melt. Dice the onion. Coat pan with garlic powder, chili powder, cumin, and salt; then add the onion. While that caramelizes, deseed and dice the bell peppers, adding them in. Stir for a minute, then add crushed tomatoes. Stir well, cover, and simmer for 4-5 minutes. Once thickened, make pits for the eggs, cracking one egg into each. Cover, and simmer for 4 more minutes (longer if you want over hard egg yolks).\nPlace a handful of tortilla chips into bowls. Prepare slices of avocado. Scoop entire poached egg and place onto chips, then scoop sauce on top. Place avocado off to side of bowl, then sprinkle queso fresco on contents of bowl. Serve with spoon.",
    "author": "Alek Miller",
    "photo": null
  },
  {
    "id": 25,
    "date": "2026-01-25T21:44:29+00:00",
    "text": "I like to cook. This is a great dish I made last month, and I made a very basic recipe for it.\n\nBasic Shakshuka\nIngredients:\nOlive oil\n1 medium yellow onion\n1 can (28oz) crushed tomatoes\nGarlic powder (to preference)\n6 eggs\n\nGet large skillet or pan up to medium heat. Dice onion. Sprinkle olive oil in pan, then add onions. Stir and cook until caramelized. Add can of crushed tomatoes and garlic powder, mix well. Cover, then simmer for 4-5 minutes. After simmering, remove cover, stir well, then make pits for eggs. Crack an egg in each pit, cover, simmer another 4 minutes. This should poach the eggs over easy. If you want over hard, extend the cook time.",
    "author": "Alek Miller",
    "photo": null
  },
  {
    "id": 23,
    "date": "2026-01-22T18:18:14+00:00",
    "text": "Anime, Abridging, and Faith\n\nCatholicism has the depth of an anime with too much lore. But first, a story.\n2011 was a more pivotal year than I remember it to be. Halfway through college, I watched all the anime I never had the chance to back in high school. I was a sucker for high-animation fight scenes like those in Ninja Scroll and Sword of the Stranger. Someone recommended Fate/Zero, read a glowing review of it, and sat down to watch it.\nIt drove the wind out of my sail. I started skipping sections and feeling no worse for wear. At the halfway point, I dropped it. Right then and there, I decided I wouldn't waste time on series and movies that didn't immediately hook me.\nSame became true of abridged series. Team Four Star's Dragon Ball Z Abridged reached episode 20 and I dropped it for much the same reason: the return diminshed while the time investment increased.\nA year later, I strove to create my own abridged series. Something I wanted to enjoy rewatching. A tribute to the fast, highly-comedic parodies that pulled me in originally. I'm pleased to say each of my episodes (including the finale) was under 10 minutes long; many clocked in under 5 minutes. I also finished the thing. That allowed me to move on to other projects. I had settled it in my mind. Abridging was a chapter in my life, one I frequently refer back to, but know in my heart that I have no more pages to write. That's a blessing, don't feel bad about it.\nMy wife commented early in our marriage that I had little patience for movies or TV shows. It amazed her I could just drop a piece of media so quickly and so early on. So this had become a practice of mine, and become outwardly observable. If I felt filler creep in, stealing my time away, I wasn't likely to continue it. I might have it on in the background on a second screen while I was busy doing something else (usually gaming in Warframe), but I wasn't really paying attention to it. Consider the episodes \"vain repitition,\" if you will.\nThat might as well bring me back to my thesis. Catholicism is like an anime with too much lore to carry. Where'd this come from? How does this possibly apply? Why do I hate Catholics?\nFirst, I love Catholics. The reverence for the spiritual and dedication to glorifying God through art and music are commendable. I see them as brothers and sisters in Christ.\nThis conclusion came from the couple of months I've observed comment debates between Catholics and non-Catholics. \"You don't have the fullness of the faith. You're missing out on the theological depth of the Catholic Church.\" It finally converged on me that this is the same argument anime and abridging fans will use to hawk their favorite series. \"You don't understand the fullness of DBZA because you haven't watched the source material.\" That's awfully close to a real reply I received. No, I'm not willing to subject myself to that many hours of a show I'm likely not going to like to challenege a conclusion I'm very unlikely to change. Think I'll take my chances on this one, thanks.\nFrieren skyrocketed in popularity around 2025. I caved and got one month of Netflix to see what it was all about. By this point, my wife was much on the same page as me with respect to pacing. She was bored after the pilot episode. \"Nothing happened. That could've been so much shorter.\"\nIt's true that the Catholic Church has a wealth of theological material to read, absorb, discuss, and wrestle with. But the conclusion I'm quickly reaching is that it's only really necessary for those who care deeply about it. Acts 16:30-31 says, \"Then he brought them out and asked, “Sirs, what must I do to be saved?” They replied, “Believe in the Lord Jesus and you will be saved, you and your household.\"\" I see no \"But wait, there's more.\"\nThe foundational, baseline, starting point Gospel is that. So many of our personally-held convictions aren't traditions everyone else must be required to follow. Paul rebuked Peter for that in the church in Galatia.",
    "author": "Alek Miller",
    "photo": null
  },
  {
    "id": 24,
    "date": "2026-01-22T18:18:14+00:00",
    "text": "He didn't rebuke Peter for his convictions; he reubked Peter for enforcing them on everyone else, for belittling those who didn't ascribe to his convictions.\nNinja Scroll is the best-paced anime movie I've ever seen. It distills its story so much, it crunches lore into lines of dialogue where they overlap with action on-screen. It's too fast for most people. I DO NOT RECOMMEND watching Ninja Scroll because every content warning under the sun applies to that film. All I'm saying is it's a masterclass in pacing, similar to how Jesus's Gospel is the distilled message of salvation for all people. There's no filler to it. It is sufficient all on its own. The fullness of the message is its single phrase. No need for a season 2 or episode 2,000.\nRacking up hours on you My Anime List profile is pointless. Writing out the 60th installment of your dumb anime parody is dumb. 2,000 years of church history can easily distract us from the one foundational truth that we always, always must come back to.\nJesus Christ is Lord.",
    "author": "Alek Miller",
    "photo": null
  },
  {
    "id": 22,
    "date": "2026-01-20T05:09:45+00:00",
    "text": "A Day In Heaven\n#webpub \nHe awoke from his daylight slumber rested and restored. Getting up, he dressed himself for work. The woman he had spent life with met him outside their respective small apartments, heading out to the plot.\nTheir plot was cared for by an unnamed Cambodian martyr. Under his supervision, the two wished the martyr a good day, Bless the Name, and headed out to dig. In life, the man had been a successful doctor. His career had several key moments of righteousness, but no one seriously thought of him as a very good man. But he believed in the Son and had not wavered in that, at least. Both had enjoyed pleasurable lifestyles during life. The martyr, naturally, did not. And so now in Paradise on the New Earth, the couple were last and the martyr was first.\nThe man dug his row while humming a hymn. The words didn't come easily, so he focused on the tunes at least. The woman followed suit, placing seeds in each furrow the man created. In due time, bok choy would grow from this line. It always would succesfully, no doubt about that.\nLunchtime arrived. The two strolled over to pear trees planted from saplings 300 years before. It was their favorite. Plucking the brown-gold fruit, they relished the sweet, better-than-real taste. Each praised the Name, then returned to their work.\nLater that afternoon, Stephen the Martyr visited. He was greeted warmly by the farmers and then their supervisor. The Cambodian and Stephen talked the rest of the day, learning more of the other, praising the Name for the opportunity and ability He gave them.\nThe two made a modest dinner of Vietnamese pho with pork broth, enough for all of them. The martyrs thanked their cooks, said grace, then dug in. The man and the woman were so happy to simply perform basic tasks that, in life, they would never have dared to bother with.\nIt was just another day in heaven.",
    "author": "Alek Miller",
    "photo": null
  },
  {
    "id": 21,
    "date": "2026-01-20T02:45:14+00:00",
    "text": "Well why doesn't a governmental authority control and delegate who has access to the data center? Wouldn't that be better than letting the public go all Wild West on it and demand more, more, more? You want a government agency to step in and regulate what we can and can't see, what data we can and can't use, how much data we can and can't process: good freaking luck, my man. That'll piss off way more than the ever-edgy libertarians and anarcho-capitalist twin cousins.\nSo this development is likely inevitable. And I even see the potential for great good to come of it. Although I'm not planning on that one bit. There is one ray of sunshine to this, however: local communities are banding together on this issue. I may ultimately disagree with them on this issue (I'm too jaded to decide right now); I'm just really glad to see small towns light their beacons and rally their populaces, getting the word out and sounding alarm bells to at least pay attention.\nThe local level is the one I care most about. The rest of the country is \"not in my backyard.\"",
    "author": "Alek Miller",
    "photo": null
  },
  {
    "id": 20,
    "date": "2026-01-20T02:45:13+00:00",
    "text": "Stories of data centers getting constructed in towns across the US have come out over the past year. One is finally slated for our area, a local friend tipped all of their friends and I happened to see the post. Didn't think I'd ever deal with this, then realized some alarming conclusions, so I'm diving deeper.\nJust YouTube alone has grown to the point where its digital data growth is over 4 petabytes per day. If you have a 1TB hard drive, get 4,000 more, and you have YouTube's daily growth. Actually a lot smaller than I imagined. Of course, that's just YouTube, one site out of billions. All the data generated in a day gets stored somewhere. That storage has to be present somewhere. Where is our Gmail account data stored? Somewhere, surely.\nI never heard debate of these data centers until the past 12 months. What's the difference? Seems to be AI (as it ever is and will be for the foreseeable future). Machine learning is something I heard about in the late 2010s to great hype. \"Big data\" was something to put on your resume. Just the initial applications for machine learning of \"big data\" showed promise, in my opinion. Lot of industries could use that kind of processing power. And think of the future: going to outer space, these applications and their complications will have to grow ...astronomically.\nRemember the crypto craze? Alarming reports went out about crypto mining operations, ostensibly placed in colder climate countries to reduce costs on keeping the electronics from overheating. Consuming vast amounts of electricity has been on the minds of environmentally-minded people for an entire century. The NIMBY-ism was there too, it's just scaled up.\n\"NIMBY\" stands for \"not in my backyard.\" Nobody wants a multi-acre, noisy, water-guzzling, energy-consuming, polluting data center across the street from them. Do I want that in my small town? No. Short and selfish answer is \"No.\" It's the natural human reaction.\nBut I can be sold on it. My price doesn't come cheap. I need to know exactly how this is going to be used. Who has access to it. What types of data are getting processed. What sort of environmental remediation treatments are promised. How those remediation treatments would be verified. Why all this? I can see industries and hospitals utilizing these data centers to boost production, cut costs, reduce wait times for patient care, increasing effectiveness, contributing to research.\nBunch of our metals come from the ground. IN the ground. That ground is rock and has to be processed if we're going to get the metals out of it. The ground isn't moving: we have to accept that. If you sit on a vein of gold or a trap of oil in your backyard, you'd think twice before rushing to refuse construction on your property. Point is you should think twice, regardless of which direction you initially want to rush off towards.\nRare Earth Elements (REEs) are a key export from overseas (China). The process for retrieving and refining them is inhumane, or exorbitant. Look up some photos of the villagers deformed by living near the operations. Oh we would never support that... Every lithium battery does. Every solar cell does. From electric vehicles to rooftop solar panels, our dollars contribute to that inhumane process.\nAI data centers could be used to invent new technologies, improve current ones, cut down on inefficiencies, free up labor for other tasks. If that's what happens, we could be looking at a huge increase in productivity, life longevity, medicine availability, industrial progress, and overall knowledge base.\nMy pessimism says otherwise. AI data centers will be used instead to flood social media with fake news, escape further from reality through games and virtual companions. That isn't the AI's fault, however. It's not the data center's fault either. That's our fault. Collectively, we're \"dun goofing\" right now. Smart phones carried this possibility too, the world's knowledge and a million useful applications in the palm of our hands. We don't use it for that and we know it.",
    "author": "Alek Miller",
    "photo": null
  },
  {
    "id": 19,
    "date": "2026-01-18T13:22:09+00:00",
    "text": "#webpub\n\nEarly\n\nI'm really, REALLY bad about getting up early in the morning. At heart, I am a morning person, but I consciously prefer acting like a night owl.\n\"Early\" applies to much more beyond the time we get up. This year, our household has the opportunity to file our taxes ridiculously early. Most years haven't been this easy; there were pre-tax investments, after-tax investments, small business incomes, small business expenditures, investment withdrawals, and occupation changing. Not this year. This year, it's just my income. Should be simple.\nTo be able to resolve our tax return before February would actually be faster than I've ever heard out of anyone. Would be a huge load of worry off our mind. Politics of the federal income tax aside, it'd be nice to just not have to think about it till next year.\nStarting this early means preparing for potential complications. Does the IRS take issue with our tax return? We have time to resolve that. Miss a source of income we previously thought invalid? We can incorporate that before April 15th. Good ol' fashioned issues with the US Postal Service? We can wait.\nEvery year we wait until early April, it's just worse. Better to just get it out of the way.\nThis applies most other places in life. Investing from an earlier age invariably leads to bigger returns. Physical exercise done earlier always leads to an easier time getting back into shape later on. Doing something right the first time is better than attempting to do it over.\nI can hear exceptions brewing in some of your heads. Of course there are exceptional circumstances. I'm not dealing with them.\nMake a point to do work, hard work, the annoying work, first. Get that out of your day's way. You will thank yourself later.",
    "author": "Alek Miller",
    "photo": null
  },
  {
    "id": 17,
    "date": "2026-01-17T22:20:35+00:00",
    "text": "*The Cheese*\n\nOctober 9, 2025\nby Juleah Miller\n#webpub\n\nThe boy trailed several feet behind his mother, stepping carefully over the cracks and only in the pale blue, dingy vinyl tiles. He found himself here among the towering, poorly organized shelves quite reluctantly, it being too hot in the middle of summer to hang out in the car. He could feel his mother's tension at the thought of having to police a toddler and hastily shop for groceries on a limited time budget. This divided attention lent well to his curious little hands and the myriad of brightly colored packages; the boxes recieving a light rebuke from mother, and glass jars invoking the full wrath of God. The scathing corrections slid right over the toddler's immature brain like water off a ducks back.\n\nLow rumbles, quiet chatter, intermittent beeps, and an inoffensive jingle mixed into a slurry of sounds assaulting and drowning the senses of the boy. The low cacophany ceased in a moment and the lights dimmed, casting the boy into deep shadow. For a moment, he paused, searching for the cause of the sudden absence of all senses. The boy's mother continued her harried shopping, her muttering and shuffling a dull note amongst the nothing.\n\nThe boy slowly became aware of the glow beyond his mother. The light grew in intensity until his mother was a mere silhouette, her shadow shrinking in the blinding light. The boy's feet stumbled forward, drawn hypnotically by the light. Eyes never leaving, he stepped around his mother. The light hit his eyes with full intensity. Instictively, his hands flew up to cover his face. Eyes watering, the glow abated as his eyes adjusted to the light. A cold blast of air chilled his cheeks. Upon the shelves, mist swirling, sat a glorious block of cheese. It was pure gold, and the smell... the smell. The boy had never smelled anything more delicious. Before he properly registered it, the cheese rested reverently in his hands. Arms cradling it as if it were a newborn fawn. The cheese was simultaneously cool and vibrantly warm.\n\nClaws sharply clutched his shoulder and the illusion broke. The rumble, beeps, chatter, and lights flooded back to his senses; the cheese ripped from his hands as quickly as his fingers found it. The scold was harsh.The words washed over his body as he watched the cheese blasphemed, merely tossed irreverantly back onto the shelf. Tears stung the boys eyes, not at the verbal barbs from his mother, but for the callous disregard for his perfect cheese.\n\nThe tongue lashing and finger wagging finished quickly, the mother remembering how little time she truly had for this excursion. The boy stood still, shocked and rooted to the spot. His mother turned away with an impatient beckoning of her hand. Head frozen, the boy's eyes slid until his gaze fell upon the cheese once more. The radiant warmth of its embrace welcomed him. His eyes slid to his mother now several feet away and counting. The timing would soon close before she turned and griped at him again.\n\nThe boy's brain didn't process the movement, but he found himself walking dutifully behind his mother, cheese in hand. The boxes and jars no longer called to him, their color dulled and ugly before the brilliant glow of the golden cheese. He gave no cause for his mother to look down. Her mood considerably brightened and the shopping experienced streamlined, the hedge maze of shelves blurring together. Nothing else was real. He had his cheese.\n\nBeep, beep, beep. The hand of the cashier deftly scanned another item from the pile of boxes and bags bumping along the wet conveyor belt. The boy's mother breathed a sigh of relief. The boy clutched the cheese, leaning as if glued to his mother's leg. Money exchanged hands. The bags crinkled in his mother's grip. She stepped away from the register and sighed with a smile. Her eyes took one last look around the area, searching for anything amiss. Her eyes fell on the boy.",
    "author": "Juleah",
    "photo": null
  },
  {
    "id": 18,
    "date": "2026-01-17T22:20:35+00:00",
    "text": "Darkness plunged around the boy once more. His cheese glowed dimmly in his arms, barely illuminating his mother standing just beyond the golden halo. A sharp whistling from afar rushed in and penetrated his ears. The boy's mothering leaned into his circle of light, her face lit from below, holding a peculiar blank expression that he had never seen before. His mother snaked her arm slowly around his middle. The boy froze. The whistling reached an earshattering pitch. Sound, darkness, and his world imploded at same time she constricted his waist.\n\nThe boy lifted high into the air, his cheese ripped from his hands by claws like razorblades. The beep, beep, beep carried on.",
    "author": "Juleah",
    "photo": null
  },
  {
    "id": 2,
    "date": "2020-10-06T03:23:30+00:00",
    "text": "Channel photo updated",
    "author": "Azirona Drift",
    "photo": null
  },
  {
    "id": 1,
    "date": "2020-10-06T03:19:08+00:00",
    "text": "Channel created",
    "author": "Azirona Drift",
    "photo": null
  }
]